package functional_style1;


/*

Тема про готовые стандартные классы, нужные для обработки наборов данных

Декомпозаия обработки элементов
При работе с наборами данных, бывает нужно отфлитровать их по критерию, упорядочить и вывести
на экран.
Дженерик-интерфейс Stream - встроенный инструмент Java, предназначенный для потоковой
обработки данных в функциональном стиле. Стрим берет всю работу по реализации на себя, нужно
только передать ему конкретные действия, применяемые при обработке.

Стреам представляет собой набор элементов для одноразового прохода с целью обработки.

Создать стрим можно простым перечислением значений, для жтого нужно вызвать статический
метод Stream.of

Другой способ создания - вызов метода stream(), который есть у каждой коллекции.


Операции над стримами
Есть два вида операций:
    - Промежуточный - задают правила изменения стрима, возвращая трансформированный поток
    исходных данных. Например можно установить фильтрацию элементов по критерию. Может
    быть выполнено сразу несколько промежуточных операций
    - Терминальные. - конечная операция, которая запускает выполнение всех промежуточных
    операций, после чего выполняет своё целевое действие и завершает работу над стримом.
    Может вызываться только один раз.

Стрим обычно не сохраняют в переменные. Все действия выполняемые со стримом, объединяются в
одну конструкцию, перечисляя их через точку.


Терминальные операции
Терминальная операция аforEach() применяет Consumer, переданный в нее параметр ко всем
элементам стрима.

Стрим из конечного числа элементов можно пересчитать через count()

Проверка, что все элементы стрима удовлетворяют определенному условию, используется
операция allMatch(), передав ей проверяемый предикат.

anyMatch() проверяет, есть ли хоть один элемент, подходяший под условие

findFirst() вернет первый элемент стрима. При этом результат будет обернут в Optional
на случай отстутсвия в стриме подходящего элемента

collect() собирает элементы стрима в коллекцию или другой объект.


Промежуточные операции

 */


import java.util.List;
import java.util.Optional;
import java.util.stream.Collectors;
import java.util.stream.Stream;

public class jeneric_stream6 {

    public static void main(String[] args) {

        // создание Stream
        Stream<String> names = Stream.of("Арсений", "Иван", "Влад");

        // стрим обхода элементов коллеции
        List<String> citiesToVisit = List.of("London", "Marid", "Moscow");
        Stream<String> visitStream = citiesToVisit.stream();

        /*
        //вызов стримов
        citiesToVisit.stream()
                .someOperation1()
                .someOperation2()
                .someOperation3()
                .someTerminalOperation();
        */

        //вывести на печать содержимое стрима
        names.forEach(System.out::println);

        //счет элементов
        long count = Stream.of("Текст1", "Текст2", "Текст3")
                .count();
        System.out.println(count); //3


        //проверка что все элементы соответствуют условию
        Stream<String> movie = Stream.of("фильм 'Аватар'", "сериал 'След'", "фильм 'Титаник'");
        boolean isAllFilms = movie.allMatch(title -> title.startsWith("фильм"));
        System.out.println("Сегодня показывают только фильмы? " + isAllFilms);

        // проверка что один из элементов походит условию
        Stream<String> movie2 = Stream.of("фильм 'Аватар'", "сериал 'След'", "фильм 'Титаник'");
        boolean found = movie2.anyMatch(title -> title.toLowerCase().contains("титаник"));
        System.out.println("Есть фильм Титаник? " + found);

        //нахождение первого элемента
        Optional<String> maybeFound = Stream.of("фильм 'Аватар'", "сериал 'След'", "фильм 'Титаник'")
                .findFirst();

        if (maybeFound.isPresent()){
            System.out.println("Первый элемент стрима: " + maybeFound.get());
        } else {
            System.out.println("Элемента нет нет");
        }

        //сбор в одну строку через разделитель
        String text = Stream.of("Текст1", "Текст2", "Текст3")
                .collect(Collectors.joining(" // ")); // разделитель
        System.out.println(text);

        // сбор в список
        List<String> collected = Stream.of("Текст1", "Текст2", "Текст3")
                .collect(Collectors.toList());
        System.out.println(collected);

    }
}
