package functional_style1;

/*

Замыкания
В процессе работы лямбда может обращаться к внешним данным: локальным переменным
метода, в котором она объявлена, его параметрам и полям объекта.

класс Person, описывает человека. У него есть любимая специя, добавляемая во все блюда
 в коде это действие представлено специальным методом addFavouriteSpice().
 он входит в состав класса Person и возврвщает мельницу, которая добавляет специю в блюда.
Мельница описывается функциональным интерфейсом UnaryOperator<String>
 Метод apply() мельницы принимает текст рецепта и возвразает его же, но с уже добавлянной специей.

Классы мельницы нужно название специи.
Реализовать можно, к примеру, через конструктор класса Adder, который будет получать специю
в качестве аргумента

Если после того как конструктор получит значение, сменить спцию, механизм добавления об этом
не узнает. Это происходит потому, что мельница запоминает конкретную спцию один раз, в момент создания.
Поэтому значение не обновляется. Чтобы это изменить, нужно вместо специи передавать объект человека.

Чтобы специя добавлялась, в объект создали специальное поле с информацией об объекте человека. Для заполнения
эирнр поля пришлось добавить конструктор.

Вместо всего этго внутри класса Person можно использовать лямбду. Ей будут видны все ячейки, доступные из места
её объявления, - в том числе поля объекта Person. Таким образом решается проблема доступа кода мельницы к данным.

Лямбда образается к полю объекта Person, внутри которого лямбда создана. И если это поле изменится, то
последуюзий вызов лямбды будет работать с уже новым значением. Этот механизм называется замыкание.
Он одинаково работает с анонимными классами, и с лямбдами.

Поля внутри лямбда можно менять через присвоение. Менять локальные переменные и параметры внутри лямбд нельщя -
обращаься к ним можно только для чтения. Поля уничтожаются сборщиком мусора вместе с объектом, когда
тот перестает быть нужен.

Локальные переменные и параметры хранятся на стеке и стираются сразу после завершения вызова метода.
Во время генерации лямюды Java добавлеет место них конкретные значения, которые в них лежят.
Такие переменные и параметры называют эффективно финальными, тоесть неизменяющимися на деле, без обязательного
объявления их с модификатором final.



****
Ссылки на методы.
Бывает так, что действия которое программист хочет заключить в реализацию функционального интерфейса -
это уже существующий метод какого-то объекта или класса.
Пример, список стран для будущих путешествий:

    List<String> countries = new ArrayList<>(List.of(
        "USA", "CB", "", "RF", "OAE"));

Допустим из-за особенностей парсинга некоторые строки оказались пустыми и их нужно убрать.
Для этого есть метод removeIf, который принимает предикат и удалет все подошедшие ему элементы.
Все что нужно сделать - передать предикат, в точности соответствующий методу isEmpty:

    names.removeIf(name -> name.ifEmpty());

Лямбда сводится к вызову метода isEmpty. Для таких случаев в java есть инструмент, называемый
ссылка на меод. Благодаря ему лямбду можно сделать компактнее:

    countries.removeIf(String::isEmpty);

Вместо . ставится :: означаешее ссылку на метод.
В виде схемы:

    ИмяКласса::нестатическийМетод
правщвается в
    параметр -> параметр.нестатическийМетод()


При этом реализуемый функциональный интерфейс по набору параметров отличается от метода, на который мы ссылаемся
Предикат на входе ждет обхект, а isEmpty не имеет параметров. Но это полностью соответствует схеме
Параметр лямбды - объект (страна), у которого будет вызван указанный настатический метов isEmpty.

Бывают случаи, когда вместо имени класса, нужно указать объект. Например, чтобы править,
есть ли страна в списке:

    Predicate<String> hasCountry = countries::contains;
тоже что и
    str -> countries.contains(str)

Этот вид ссылки на метод работает по схеме:
    объект::нестатическийМетод
превращается в
    параметр->объект.нестатическийМетод(паоаметр)

Похожая логика будет при использовании класса и статического метода:
    ИмяКласса::статическийМетод
превращается в
    параметр -> ИмяКласса.статическийМетод(параметр)


Есть еще один вид ссылки на метод - ссылка на конструктор. И хотя конструктор не является обычным методом,
по своей роли он похож на статический метод, с помозью которого мы получаем новые объекты класса.
Схема ссылки на конструктор следуюзая:
    Класс::new
становится
    параметр -> new Класс(параметр)

Чтобы реализовать функциональный интерфейс, метод которого принимает capacity
и возвращает новый ArrayList:

    Function<Integer, ArrayList<Integer>> listCreator = ArrayList::new;

    capacity -> new ArrayList<>(capacity)

Метода apply функционального интерфейса Function принимает число и возвращает ArrayList. Реализация
метода отсылает к конструктору с переметтром-числом.
*/


import java.util.function.Predicate;
import java.util.function.UnaryOperator;

class Person{
    private String name;
    private int age;
    private String fovouriteSpice; // специя

    public Person(String name, int age, String fovouriteSpice){
        this.name = name;
        this.age = age;
        this.fovouriteSpice = fovouriteSpice;
    }

    public String getName() {
        return name;
    }

    public String getFovouriteSpice() {
        return fovouriteSpice;
    }

    public void setFovouriteSpice(String spice) {
        this.fovouriteSpice = spice;
    }

    // генерация мельницы для добавления специи
//    public UnaryOperator<String> addFavouriteSpice(){
//        return new Adder(fovouriteSpice);
//    }
    public UnaryOperator<String> addFavouriteSpice(){
        return recipe -> recipe + " " + fovouriteSpice;
    }

    //возвращает кто из студентов старше
    public Predicate<Person> isOlderPredicate(){
        return person -> person.age > age;
    }


    //любая новая специя становилась любимой
    // если ее название длинее назввания нынешней
    public Consumer<String> trySpice(){
        return spice -> {
            if (spice.length() > fovouriteSpice.length()) {
                fovouriteSpice = spice;
            }
        };
    }

}

class Adder implements UnaryOperator<String>{
    private String favouriteSpice;

    public Adder(String favouriteSpice){
        this.favouriteSpice = favouriteSpice;
    }

    @Override
    public String apply(String recipe){
        return recipe + " " + favouriteSpice;
    }
}


public class lambda4 {

    public static void main(String[] args) {
        Person person = new Person("Яна", 18, "Корица");

        String oldRecipe = "яйца молоко соль";
        UnaryOperator<String> adder = person.addFavouriteSpice();
        String newRecipe = adder.apply(oldRecipe);
        System.out.println(newRecipe);

        person.setFovouriteSpice("Яблоки");
        newRecipe =adder.apply(newRecipe);
        System.out.println(newRecipe);

        System.out.println(person.isOlderPredicate().test(new Person("Старше", 25, "")));
        System.out.println(person.isOlderPredicate().test(new Person("Младще", 17, "")));
    }

}
