package functional_style1;

/*
Для описания новых функциональностей лучше использовать функциональный интерфейс.
Для создания и передачи действий как объектов, подходят анонимные классы.
Это не единственный способ быстрой имплементации интерфейсов.

Лямбда-выражения - инструмент позволяющий быстро и компактно имплементировать функц
интерфейс.

Пример: Реализация предиката, проверяющего с большой ли буквы написан текст

    Predicate<String> x = (String text) -> {
            return Character.isUpperCase(text.charAt(0));
        };

Лямбда выражения состоит из двух частей разделенных -> :
    (вводные параметры) -> {блок реализации функционального интерфейса}

Правила синтаксиса лямбда-выражений:
    - у лямбды может быть 0 и более входных параметров.
    - параметры заключаются в круглые скобки и разделяются запиятыми
    например: (String country, int size)
    - Если параметр один и его тип явно не указывается, скобки можно не писать.
    Например лямбда вычисляет, за сколько часов приодолеем дистанцию при 100 км/ч
    distance -> distance / 100
    - Если параметров нет, нужно поставить пустые круглые скобки.
    () -> "text"
    - Тело лямбды может состоять из 0 и более выражений
    - если тело состоит из одного оператора, его можно не заключать в фигурные скобки.
    Возвращаемое значение в этом случае можно указать без ключевого слова return
    - Во всех остальных случаях фигурные скобки обязательны, а в конце блока когда
    необходимо указать возвращаемое значение с использованием ключевого слова return
    (иначе типом возвращаемого значения будет void)


******
Лямбда и анонимный класс
Отличии

Функциональный интерфейс Consumer<String> описывает объект который приветствует любого, кто
скажем ему свое имя через вызов абстратктного метода accept(), принимающего один параметр
типа String

    Consumer<String> greeter = new Consumer<>() {
        @Override
        public void accept(String name) {
            System.out.println("Привет, " + name + "!");
        }
    };

    greeter.accept("Дарья");

Реализация того же интерфейса через лямбду

    Consumer<String> greeter = (String name) -> {
        System.out.println("Привет, " + name + "!");
    };

    greeter.accept("Дарья");

Что изменилось:
    - Ичез new, Java и так поняла что мы хотим новый объектт
    - исчезло упоминание интерфейса - Java видит тип ячейки (переменная, параметр и т.д.)
    в которую будет сохранен создаваемый лямбдой объект.
    - Нет названия метода, так как в реализуемом интерфейсе всего один абстрактный метод,
    и java однозначным образом поределяет, что речь идет именно о нем.
    - Нет модификаторов доступа. Они не нужны, так как доступ регулируется типом ячейки.
    - Не указывается тип возвращаемого значения. Java узнает о нем из информации о реализуемом методе.

При этом остался блок параметров, та как его отсутствие ухудшило бы читаемость кода.

В итоге сгенерировали объект, имплементирующий интерфейс Consumer, в более компактной форме,
чем через анонимный класс. Но можно еще сократить. К примеру не указывать тип параметра, потому
что он будет понятен из конктекста. Если параметр один, круглые скобки вокруг него не нужны.
Если тело метода одна команда, можно не ставить фигурные скобки.

    Consumer<String> consumer = name -> System.out.println("Привет, " + name + "!");
    consumer.accept("Maria");

Если параметров несколько, нужно перечислить их через запятую внутри круглых скобок.
Если тело метода состоит из одного return, то можно убарть фигурные скобки, обязательно удалив
вместе с ними слово return.

    Comparator<String> comparator = (s1, s2) -> s1.length() - s2.length();
    System.out.println(comparator.compare("Привет", "Дарья!"));


По сравнению с лямбдами анонимные классы могут показывать устаревшим инструментом. НО это не так
Лямбды имеют более узкое применение в коде: не всё что можно сделать через анонимный класс, делаетчя
через лямбду.

Лямбдами можно реализовывать только функциональные интерфейсы, то есть то, которые содержат ровно
один метод. Если же асбтрактных методов в интерфейсе много, лямбда с такой задачей не справится.
В анонинмых классах можно обьявлять поля и исопльзовать их в реализуемых методах, в то время
как в лямбдах полей быть не может.


 */


import java.util.function.Predicate;

public class lambda3 {

    public static void main(String[] args) {

        Predicate<String> x = (String text) -> {
            return Character.isUpperCase(text.charAt(0));
        };
    }

}
