package functional_style1;

/*

Основная идея Функционального стиля программирования - обращение с действиями как с
объектами, которые можно сохранять в переменные и передавать в методы в качестве аргументов.


*****
Проблемы обычного стиля.
Нужно доработать программу для сохранения истории приложения. Написать класс StringSaver
объект которого должен хранить в себе ограниченное количество сообщений.
Без использования функ стиля это будет выглядить так:
    - Для хранения строк внутри объекта использовать список
    - Максимальный размер списка указать в стат поле MAX_SIZE
    - При добавлении очередной строки проверять размер списка. Если список
    заполнен, удалить из него самую первую строку, а новую добавиь в конец

Допустим, объекту внутри которого хранятся строки, нужно добавить новый режим работы.
При этом есть условие:
    - за включение и выключение режима должен отвечать спец метод
    - если режим включен, то для каждой строки будут указываться дата и время ее save

Для реализации можно использовать сеттер setDoAddDate(). Он будет выставлять флаг со значением
true или false в поле, хранящем информвции о включенности режима. Метод сохранения сможет
ориентироваться на этот флаг и в случае, если значение окажется true,
 будет с помощью LocalDateTime.now() указывать точный момент времени в началее сообщения.

 1) При добавлении дополнительных ключевых слов или преобразований придется менять код самого класса.
 2) При добавлении новых функциональностей повышается сложность кода, что приводит к увел кол-ва багов.

 Эти проблемы решает функциональный стиль.

 ******
 Когда объект описывает действия
 Вместо каждого изменения кода хранилища можно спроектировать класс так, чтобы пользователь
 передавал нужную логику действий обычным параметром. Но так как метод нельзя передавать
 напрямую в качестве аргумента, можно созать интерфейс StringSaverConfig

действие transform() (трансформация строки перед её сохранением) и действие onSave() (реакция на сохранение)
упакованы в интерфейс StringsSaverConfig. То есть объект класса, имплементирующего
 этот интерфейс, будет описывать не предметы, как обычно, а действия.

Хранилище строк будет принимать такой объект в качестве параметра и при необходимости
использовать его методы.

Функциональный силь позволяет через параметры передавать объектам любые действия - как если
бы сами эти действия были объектами.

Теперь если понадобиться добавить в программу еше какое-либо преобразование, достаточно
будет имплементировать интерфейс StringSaverConfig и прописать в нем новую функциональность.
А затем передать ее в класс хранилища строк как объет.


******
Анонимные классы
Для реализации хранилища в функциональном стиле нужно два инструмента:
    - интерфейс, описывающий действия, которые мы хотим передать объекту
    -  класс, имплементирующий этот интерфейс и реализующий новыую
    функциональность в своих методах

Это не оптимальное применение функц стиля. При каждом добавлении новых действия, прийдется
создавать по одному новому классу и интерейсу. Этого можно избежать.

Допустим есть программа для доставки с роботами. Нужна новая опция: по прибытию на место курьер
совершал специальное действие в случае, если клиент оставил запрос на это действие в коментарии.
Чтобы добавить эту опцию в код, придется создать новый класс

    // создаём объект с нужным действием
    DeliveryConfig config = new Knock10TimesDeliveryConfig();

    // передаём его туда, куда хотим передать
    deliveryService.send(config);

    // ....
    // где-то в другом месте кода:
    class Knock10TimesDeliveryConfig implements DeliveryConfig {
        ...
    }

Создали класс с уникальным именем, объект которого будет передавать как набор действий
Класс - это шаблон для будующих объектов, в данной ситуации он будет использоваться только
в одном месте программы и только один раз. Одноразорвый шаблок.

В случае когда объект класса использоуется только в одном месте, есть специальный иснтрумент
Анонимный класс. Такой класс можно объявить прямо в момент создания его объекта. Для этого нужно
после объявления переменной и знака = написать ключевое слово new, затем указать родителя
или имплементируемый интерфейс, поставить () и после в {} написать реализацию

Анонимный класс избавляет от необходимости создавать обычный именованный класс где-то
в другой части программы. Вместо этого можно быстро ввести нужный объект с действием там, где необходимо




 */


import java.util.LinkedList;
import java.util.List;

interface StringSaverConfig{
    //обхект класса, импрементируюшего этот интерфейс, будет описывать не предметы, а действия

    // как нужно преобразовать сохраняему строку?
    String transform(String line);

    // дополнительное действие при сохранении
    void onSave(String line);

}

class StringSaver{
    // количество заполняемых строк
    public static final int Max_SIZE = 300;

    // связный список для быстрого удаления с начала
    private List<String> saved = new LinkedList<>();
    private StringSaverConfig config;


    public StringSaver(StringSaverConfig config){
        this.config = config;
    }

    // сохранить новую строку
    public void save(String line){
        if (saved.size() == Max_SIZE) {
            saved.remove(0);
        }
        line = config.transform(line);
        saved.add(line);
        config.onSave(line);
    }

    //получить последний MAX_SIZE сохраненных строк
    public List<String> getSaved() {
        return saved;
    }
}


public class styleProgramming1 {

//    public static void main(String[] args) {
//        StringSaver saver = new StringSaver();
//        saver.save("Пользователь логин");
//        saver.save("Пользователь загрузил");
//        saver.save("Пользователь пополнил счет");
//        saver.save("Пользователь вывел деньги");
//        System.out.println();
//    }
}
