package files3;

/*

Кодировка или набор символов - числовое значени (десятичное) обозначающее для системы
тот или иной символ.

В случае неправильного типа кодировки, система отображает неразборчивый набор символов.

**
ASCII - Американский стандартный код для обмена информации. Имеет 128 символов.
0-32 - невидимые управляющие символы. 33-126 - видимые.
Для других международных языков, используется ISO 8859.

**
Юникод - стандарт кодировки символов, охватываюзий современные алфавиты, цифры,
знаки применения, метатические, денежные, музыкальные символы и прочие символы.
Преобладающий стандарт в интернете.
UTF-8 - наиболее распространенная реализация Юникода. Универсальная и имеет резерв
для дальнейшего расширения.

**
Для представления кодировок есть специальный класс Charset, а так же класс
StandardCharsets с константами для стад наборов символов.

В классе Charset есть метод static Charset forName(String charsetName), возвращающий
обхект кодировки по имени. В качестве параметра charsetName может быть как стандартное
имя кодировки, так и её псевдоним. utf8, UTF-8, utf-8 распознает одинаково.

**
Кодировка по умолчанию
Часто в программах кодировку нужно указывать явно. Иначе будет использоваться
кодировка по умолчанию. Она определяется во время запуска вирт машины и сохраняется
в своействе file.encoding. Значение завивсит от выбранного языка и кодировки самой ОС.

Определить кодировку по умолчанию можно с помощью метода defaultCharset() класса Charset.

Кодировка по умолчанию - глобальный параметр. Нельзя установить для разных классов разную кодировку.
Нельзя изменить в процессе выполнения программы.
При сохранении программы, кодировка на разных машинах может вести себя по разному, в
зависимости от окружения.

Для решения проблемы с кодировкой исп параметр запуска Java:
    java - Dfile.encoding=UTF-8 <название программы>

**
Кодировки и строки.
Для превращения String в байтовый массив, исп метод getBytes().
Сложность заключается в том, что применяется кодировка символов по умолчанию.
Рекомендуется использовать сигнатуры с указанием кодировки, такие как:
byte[] getBytes(Charset charset) и String(byte bytes[], String charsetName)



 */


import java.nio.charset.Charset;
import java.nio.charset.StandardCharsets;

public class encoding4 {

    public static void main(String[] args) {
        // отображение символа соответствующего значению ASCII
        System.out.println((char) 89);

        // UTF-8
        System.out.println("\u041F\u0440\u0430\u043A\u0442\u0438\u043A\u0443\u043C");


        Charset charset1 = Charset.forName("UTF8");
        System.out.println(charset1);

        Charset charset2 = StandardCharsets.US_ASCII;
        System.out.println(charset2);

        System.out.println(Charset.defaultCharset().displayName());


        // преобразование из строки в массив байтов
        String s = "Обычная строка.";
        byte[] buffer = s.getBytes(StandardCharsets.UTF_8);

    // преобразование из массива байтов в строку
        byte[] buffer2 = new byte[1000];
        String str = new String(buffer2, StandardCharsets.UTF_8);
    }
}
